package com.company;
import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
	// write your code here
        Scanner scanner = new Scanner(System.in);
        int a,b;
        System.out.print("Число: ");
        a = scanner.nextInt();
        System.out.println(a*1.15);


    }
}
/*
Пользователь вводит число, необходимо увеличить это число на 15% и вывести результат на экран
*/
