package com.company;

public class Main {

    public static void main(String[] args) {
	// write your code here
        long a;
        a=1*2*3*4*5*6*7*8*9*10;
        System.out.println(a);
    }
}
/*
Вывести на экран произведение 10 чисел от 1 до 10.
Результат - это 1 число.
Подсказка:
будет три миллиона с хвостиком.
Требования:
•	Программа должна выводить целое число на экран.
•	Метод main должен вызывать функцию System.out.println.
•	Выведенное число должно быть больше трех миллионов.
•	Выведенное число должно соответствовать заданию.
*/
